; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob5015) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear crate0)
	(at pallet2 distributor1)
	(clear crate3)
	(at truck0 depot0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot0)
	(on crate2 crate1)
	(at crate3 distributor1)
	(on crate3 pallet2)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 pallet0)
		(on crate2 pallet2)
		(on crate3 crate1)
	)
))

; plan
1. (lift hoist0 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate1)
   added: (lifting hoist0 crate2) (clear crate1)
   goals met: 2 of 4
2. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 4
3. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 2 of 4
4. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 2 of 4
5. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 2 of 4
6. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 2 of 4
7. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 2 of 4
8. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 4
9. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 2 of 4
10. (drop hoist2 crate2 pallet2 distributor1)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 pallet2)
   goals met: 3 of 4
11. (drop hoist0 crate3 crate1 depot0)
   deleted: (lifting hoist0 crate3) (clear crate1)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate1)
   goals met: 4 of 4
